{
  "MEC-110 & MECE-004: Money, Financial Institutions and Markets": {
    "SECTION A (20 Marks Questions - Answer any 2 in 500-700 words each)": [
      "1. What are the main components of a financial system? What are the functions of a financial system in the economic development of a country?",
      "2. Bring out the role of financial system in economic development of a country. Describe the main components of a financial system.",
      "3. Describe the components of financial markets. How is secondary market different from the primary market? What are the functions and obligations of merchant bankers?",
      "4. What is meant by financial system? Explain the role and significance of a sound financial system in the process of economic development.",
      "5. Describe the key channels underlying the transmission of financial activities in an economy. What are the roles of various financial intermediaries in the transmission process?",
      "6. What are the various ways in which companies raise finance? Discuss the main issues regarding the capital structure of firms.",
      "7. Discuss the importance of debt and equity share capital as means of raising finance in the capital market. In this context, discuss the Modigliani-Miller hypothesis.",
      "8. Discuss debt and equity as means of raising finance by a firm. In this context, discuss the Modigliani-Miller hypothesis.",
      "9. Describe the methods of financing by firms. In this context, bring out the major issues regarding capital structure of firms.",
      "10. Explain the concept of an option as a financial asset. Discuss the Black-Scholes' model of pricing of options. What are its limitations?",
      "11. What are call and put options? When can the call option and put option be exercised? [Include practical problem: Raj is willing to buy a share of X Pvt. Ltd. After 3 months, its probable prices are ₹5, ₹10, ₹15, ₹20, ₹25, ₹30. Raj purchases a call option from a dealer who gives the exercise price of ₹13 and option premium of ₹12. (i) Suggest when to exercise the call option. (ii) Sketch the Net Payoff diagram from the point of view of Raj and the derivative dealer.] What do you understand by Put-Call Parity?",
      "12. What are \"derivative instruments\"? Explain the various financial derivatives traded in the financial markets.",
      "13. Distinguish between the Binomial model and the Black-Scholes model of derivative pricing.",
      "14. How does the Capital Asset Pricing Model (CAPM) explain the relationship between risk and return? Discuss some of its applications. What are theoretical and practical limitations of this model?",
      "15. Explain the Capital Asset Pricing Model (CAPM). Discuss how the Arbitrage Pricing Theory builds upon the CAPM.",
      "16. Explain the concept of risk and return related with financial assets. Discuss the various theories of asset pricing for determining the prices of financial assets.",
      "17. Define financial assets. Explain the approaches to analyse risks associated with financial assets.",
      "18. Explain the different market anomalies observed in the market. Using the concepts of behavioural finance, explain the following: (i) Equity premium puzzle (ii) Volatility puzzle (iii) Predictability puzzle.",
      "19. Discuss Milton Friedman's modern quantity theory of money and compare it with Keynes' theory of demand for money.",
      "20. Critically evaluate the Keynesian perspective on money. Describe the Keynesian analysis using IS-LM framework.",
      "21. Explain Fisher's hypothesis on money, interest and inflation. Do Indian financial markets support this hypothesis?",
      "22. Explain the supply of money through the money multiplier process. What would be the effect of an increase in money supply on the equilibrium in the money market?",
      "23. Describe the importance of expected utility in decision-making under uncertainty. Explain how risk-aversion influences decision-making.",
      "24. Explain how expected utility is used in decision-making under uncertainty. What is meant by risk-aversion?",
      "25. Analyze the relationship between default tendencies and key observables of a borrower in credit risk measurement.",
      "26. \"Mathematical models in credit risk serve a dual purpose of simultaneously estimating default probability as well as valuation of risky loans.\" Elaborate this statement.",
      "27. What are the major factors influencing the exchange rate? Discuss the exchange rate arrangement in India.",
      "28. How does the IMF differ from the World Bank? Explain the significance of Bretton Woods Institutions in the global political economy.",
      "29. What is the need for regulation of capital market in India? In this context, critically examine the role of Securities and Exchange Board of India."
    ],
    "SECTION B (12 Marks Questions - Answer any 5 in 250-400 words each)": [
      "30. Discuss the main functions of investment banks.",
      "31. Describe the importance and functions of merchant banks.",
      "32. Write short notes on: (a) Functions of a Merchant Bank (b) Futures market",
      "33. Explain the concept of investment banking. Discuss the process of underwriting of securities of investment banks.",
      "34. Describe the functions of the Reserve Bank of India. How does it control credit creation by commercial banks?",
      "35. Describe the main instruments at the disposal of the Central Bank to conduct monetary policy in India.",
      "36. Describe some characteristics of bonds.",
      "37. Differentiate between Yield to Call (YTC) and Yield to Maturity (YTM). [Include calculation: Using approximation formula, calculate the yield to maturity when coupon rate is 7%, face value is ₹500, price of bond is ₹350 and maturity period is 10 years.]",
      "38. Distinguish between: (a) Current yield and yield to maturity",
      "39. What is the role of the reserve requirement in the money multiplier process? How does the money multiplier process contribute to the expansion of broader money supply?",
      "40. Explain the nature and significance of money supply using the money multiplier process.",
      "41. What is a money market? Discuss the various instruments of money market used in India.",
      "42. What are the main factors affecting money market? Explain why the linkages between the money market and monetary policy are important.",
      "43. Describe the key features of Markowitz's Portfolio Theory. Discuss some of its limitations.",
      "44. How does portfolio management optimize risk and return? What are the different stages involved in constructing and maintaining an effective investment portfolio?",
      "45. Explain the relationship between risk and return of a portfolio.",
      "46. Discuss the role of stock market in an economy. As an asset, how does a bond differ from a share?",
      "47. Differentiate between the following: (a) Certificate of Deposits (CDs) and Commercial papers (b) Primary and Secondary Securities",
      "48. What is meant by depository system? Discuss the advantages of depository system.",
      "49. Explain the need and role of depository system in secondary financial markets.",
      "50. What is secondary financial market? Give a brief account of the structure of secondary financial market in India.",
      "51. Explain the nature of futures as a financial derivative. How does it help in risk management?",
      "52. Distinguish between futures contract and forward contract.",
      "53. What is a commodity futures market? Explain the functioning of such a market.",
      "54. Why is there a need for regulation of financial institutions? Briefly discuss about some of the key financial regulatory bodies in India.",
      "55. Discuss the role of SEBI in the Indian Financial Market.",
      "56. Discuss the role of Securities and Exchange Board of India (SEBI) in the Indian financial market.",
      "57. Critically examine Arbitrage Pricing Theory (APT).",
      "58. Bring out the salient features of the Capital Asset Pricing Model (CAPM).",
      "59. Explain the Arbitrage Pricing Theory.",
      "60. Write short notes on: Arbitrage Pricing Theory",
      "61. Discuss the three versions of the Efficient Market Hypothesis (EMH).",
      "62. Write short notes on: Efficient Market Hypothesis",
      "63. Distinguish between the expectations hypothesis and the market segmentation hypothesis for the explanation of the 'term structure of interest rates'.",
      "64. Why does money have time value? Discuss the various theories explaining the levels of interest rates prevailing in an economy.",
      "65. Bring out the salient features of the Loanable Funds Theory of interest rates.",
      "66. Discuss the various interest rate risk measurement models.",
      "67. Write short notes on: Market Segmentation Hypothesis",
      "68. Discuss the concepts of competition, concentration and efficiency in the financial system of a country.",
      "69. Write short notes on: Structure of Indian Financial System",
      "70. Bring out the basic tenets of expected utility hypothesis.",
      "71. What advantages do flexible exchange rates have over fixed ones?",
      "72. What is meant by convertibility of a currency? Describe the importance of currency convertibility.",
      "73. What is Customs Union? How does it work? In what way is a Customs Union different from an Optimum Currency Area?",
      "74. Distinguish between customs union and a free trade area.",
      "75. What is a free trade area? Explain the difference between trade creation and trade diversion effect of custom union.",
      "76. Explain how an optimum currency area works.",
      "77. Write short notes on: Optimum Currency Area (OCA)",
      "78. Explain flow-of-fund accounts of an economy. What is a flow-of-funds matrix? What is its significance?",
      "79. Critically assess the Black-Scholes model of option pricing.",
      "80. What do you understand by market liquidity? Explain how financial intermediaries increase the liquidity in the economy.",
      "81. Distinguish among Markov expectations, adaptive expectations and rational expectations.",
      "82. Distinguish between Markov expectations, Adaptive expectations and Relational expectations in the context of financial markets.",
      "83. What is meant by leverage? Explain how a firm can benefit by using leverage.",
      "84. Write short notes on: Leverage",
      "85. Examine the benefits and costs associated with initial public offering.",
      "86. Write short notes on: Initial Public Offerings (IPOs)",
      "87. State the achievements and failures of the Bretton Woods Institutions.",
      "88. Write short notes on: (a) World Bank Group (b) Special Drawing Rights (SDRs)",
      "89. Write short notes on: Market Risk",
      "90. Distinguish between: (a) Money and near-money (b) Banks and non-bank financial intermediaries",
      "91. Write short notes on: Commodity Bargain Markets"
    ]
  },
    "MCS-224: Artificial Intelligence and Machine Learning": {
    "QUESTION 1 (COMPULSORY - Total 40 Marks)": [
      "1. Compare Artificial Intelligence (AI), Machine Learning and Deep Learning. (6)",
      "2. Compare Artificial Narrow Intelligence (ANI), Artificial General Intelligence (AGI) and Artificial Super Intelligence (ASI). (5-6)",
      "3. Compare descriptive, predictive and prescriptive analytics in machine learning. (6)",
      "4. Discuss descriptive, predictive and prescriptive analytics in machine learning. (5)",
      "5. Discuss Supervised, Unsupervised and Reinforcement Learning. (5)",
      "6. What is Min-Max Search Strategy? Write MINIMAX algorithm. (5)",
      "7. Briefly discuss the Adversarial search. Name the techniques used for adversarial search. (5)",
      "8. Differentiate between informed search and uninformed search. Name one algorithm for each. (4)",
      "9. Write algorithm for BFS (Breadth-First Search). Write the time complexity and space complexity of BFS. (5)",
      "10. Describe the Modus Ponens and Modus Tollens as propositional rule of inference. (5)",
      "11. What is Prenex Normal Form (PNF)? Transform the following formula into PNF: ∃x(Q(x) → ∀y R(x,y)) (5)",
      "12. Write steps to transform FOPL (First Order Predicate Logic) to PNF (Prenex Normal Form). Apply the steps to transform ∃x(Q(x) → ∀y R(x,y)) to PNF. (6)",
      "13. Obtain Conjunctive Normal Form (CNF) for the formula: D → (A → (B ∧ C)) (5)",
      "14. What is Skolomization? Skolomize the expression: ∃X₁ ∃X₂ ∀Y₁ ∀Y₂ ∃X₃ ∀Y₃ P(X₁, X₂, X₃, Y₁, Y₂, Y₃) (4)",
      "15. What is skolomization? What is the utility of skolomization? Skolomize the following expression: ∃x₁ ∃x₂ ∀y₁ ∀y₂ ∃y₃ ∀x₃ P(x₁, x₂, x₃, y₁, y₂, y₃) (6)",
      "16. Let C(x) mean \"x is a used car dealer\", and H(x) mean \"x is honest\". Translate each of the following into English sentences: (5)",
      "17. ∀x(C(x) → H(x))",
      "18. ∃x(C(x) ∧ ¬H(x))",
      "19. ∃x(H(x) → C(x))",
      "20. Given C(x) = \"X is a used car dealer\", and H(x) = \"X is honest\" then translate the following into English sentences: (5)",
      "21. ∃x C(x)",
      "22. ∀x H(x)",
      "23. ∀x(C(x) → ~H(x))",
      "24. ∀x(C(x) → H(x))",
      "25. ∃x(H(x) ∧ C(x))",
      "26. Let P(x) and Q(x) represent 'x is a rational number' and 'x is a real number', respectively. Symbolize the following sentences: (5)",
      "27. Every rational number is a real number",
      "28. Some real numbers are rational numbers",
      "29. Not every real number is a rational number",
      "30. Explain forward chaining systems with suitable example. (6)",
      "31. Explain backward chaining system with a suitable example. (6)",
      "32. Draw block diagram for the machine learning cycle. Also list the steps involved in machine learning cycle. (6)",
      "33. State the basic steps of machine learning cycle and briefly discuss them. (5)",
      "34. What is Ensemble Learning? Briefly discuss any one of the ensemble learning method. (5)",
      "35. Discuss ensemble-learning. (7)",
      "36. Draw confusion matrix and write formula for accuracy, precision, sensitivity and specificity. (5)",
      "37. What is a Neural Network? How biological neuron relates to Artificial Neuron? Illustrate with suitable diagram and a table to map the components of Biological Neuron with Artificial Neuron. (5)",
      "38. Explain the working of FP growth algorithm. Give advantages of FP growth over Apriori Algorithm. (6)",
      "39. What is the advantage of using Princer algorithm over Apriori algorithm? Explain in brief. (8)",
      "40. Compare clustering and classification. Give suitable example for each. Also, list the algorithms for each. (5)",
      "41. Differentiate between clustering and classification technique. List any two algorithms for each. (6)",
      "42. Briefly discuss the concept of classification, regression and clustering. Also give the list of algorithms for each concept. (5)",
      "43. Differentiate between linear regression and polynomial regression techniques. (5)",
      "44. What is Logistic Regression? Briefly discuss the various types of logistic regressions. (5)",
      "45. What is logistic regression? Briefly discuss the various types of logistic regressions. (5)",
      "46. What is Reinforcement Learning? Classify the various reinforcement learning algorithms. (5)",
      "47. Differentiate between Lazy learners and Eager learners in classification problem. Also, list the algorithms used for each type of learners, respectively. (6)",
      "48. Explain the term 'Dimensionality Reduction'. Name the general techniques used to perform it. Also give merits and limitation of dimensionality reduction. (6)",
      "49. Discuss the advantages and disadvantages of dimensionality reduction. (5)",
      "50. Explain the working of partition based clustering. Mention any two methods used for partition based clustering. (5)",
      "51. What is the purpose of feature extraction in machine learning? Explain in brief. (5)",
      "52. With reference to D-S (Dempster Shafer) theory, what are the different types of evidences? Explain them briefly. (5)",
      "53. Explain Turing test with suitable example. (5)",
      "54. For the following fuzzy set: (5) A = {a/0.5, b/0.6, c/0.3, d/0, e/0.9} and B = {a/0.4, b/0.5, c/0.8, d/0.2, e/0.9} find fuzzy sets:",
      "55. A∪B",
      "56. A∩B",
      "57. (A∩B)′"
    ],
    "QUESTION 2 (20 Marks - Attempt any 3 questions from Q2-Q5)": [
      "58. Explain Turing test, with the help of a block diagram. Also, discuss Chinese room test as criticism to Turing test. (10)",
      "59. Explain Chinese room test as Criticism to Turing test, with suitable example. (5)",
      "60. Briefly discuss the following, with suitable example for each: (10)",
      "61. Rule-based machine learning",
      "62. Bayesian Algorithms",
      "63. Decision trees",
      "64. Dimensionality reduction",
      "65. Briefly discuss the following (give suitable example for each): (10)",
      "66. Rote learning",
      "67. Supervised learning",
      "68. Unsupervised learning",
      "69. Delayed-Reinforcement learning",
      "70. In context of Intelligent Agents, what are task environments? Explain the standard set of measures for specifying a task environment under the heading PEAS. (10)",
      "71. Briefly discuss the Min-Max Search Strategy. What are the properties of Minimax Algorithm? Also give advantages and disadvantages of Minimax search. (10)",
      "72. Explain Min-Max search algorithm with suitable example. Give properties of Min-Max search algorithm. Also, write its advantages and disadvantages. (7)",
      "73. Compare descriptive, predictive and prescriptive analytics, performed under machine learning. (6)",
      "74. Write and explain Depth First Search (DFS) algorithm. Give time and space complexity of DFS algorithm. Also give its advantage and disadvantage. (7)",
      "75. Compare artificial intelligence, machine learning and deep learning. (6)",
      "76. What do you understand by state space in AI? What is its utility? Write production rules for state space representation of water jug problem. (7)",
      "77. Write and explain Breadth First Search (BFS) algorithm. Discuss its space and time complexity. Also, give advantage and disadvantage of BFS algorithm. (7)",
      "78. Differentiate between Hierarchical clustering and Partition-based clustering with a suitable example of each concept. (10)",
      "79. Explain K-means clustering algorithm with the help of a suitable example. (10)",
      "80. Let the following points are to be clustered into 3 groups: A₁(2,11), A₂(2,15), A₃(8,5), A₄(6,8), A₅(7,9), A₆(6,3), A₇(1,4), A₈(4,8). Assume that the initial cluster centers are A₁(2,11), A₃(8,5) and A₈(4,8). Using the Manhattan distance measure and K-mean clustering algorithm, calculate the cluster heads after third iteration. (10)",
      "81. Explain Single linkage, Complete linkage and Average linkage with a suitable example. (10)"
    ],
    "QUESTION 3 (20 Marks)": [
      "82. What do you understand by State Space Search? Explain the state space representation of Water-Jug Problem (WJP), given below: \"Given two jugs of 5-gallon and 3-gallon, both of which do not have measuring indicators on them. The jugs can be filled with water with the help of any pump, any number of times.\" The question is \"how can you get 4 gallons of water in a 5-gallon jug?\" (10)",
      "83. What is Binary Classification? Can binary classification algorithms be altered to work for problems with more than two classes? Justify. Also, discuss one-versus the rest and one-versus-one approach. (10)",
      "84. Differentiate between predicate and propositional logic. If P(x) ≡ \"x is a rational number\" and Q(x) ≡ \"x is a real number\" then symbolize the following sentences: (5)",
      "85. Every rational number is a real number",
      "86. Some real numbers are rational",
      "87. Not every real number is a rational number",
      "88. What do you understand by the term 'Resolution' in AI? Discuss the utility of Resolution mechanism in AI. Apply it to conclude 'Raman is mortal' from the knowledge given below: (7)",
      "89. Every man is mortal",
      "90. Raman is a man",
      "91. Explain the concept of resolution and unification in AI, with suitable example for each. (7)",
      "92. Frames",
      "93. Scripts",
      "94. Semantic nets",
      "95. Explain rule based systems in AI. Give advantages and disadvantages of rule based systems. Also, give the two important sources of uncertainty in rule based systems. (8)",
      "96. For the following given transactions Data_set, generate association rules using Apriori algorithm. Assume support = 50% and confidence = 75%: (10)",
      "97. For the following given transaction data-set, generate association rules using Apriori algorithm. Assume Support = 20%, Confidence = 40%: (10)",
      "98. Let the training dataset for tissue paper whether it is 'Poor' or 'Fine' based on two properties (acid durability and strength) are as follows: (10)",
      "99. Suppose there is an unknown sample X = (3, 7), where 3 is acid durability and 7 is strength, find its class using KNN algorithm. (Assume K = 3 and use Euclidean distance)."
    ],
    "QUESTION 4 (20 Marks)": [
      "100. Differentiate between the following: (10)",
      "101. A* and AO* algorithm",
      "102. Depth first search and Breadth first search",
      "103. Differentiate between the following, with an example for each: (10)",
      "104. Classification techniques and Regression techniques",
      "105. Lazy learner algorithms and Eager learner algorithms",
      "106. Differentiate between the following (give example for each): (7)",
      "107. Logistic regression and Linear regression",
      "108. K-NN algorithm and K-means algorithm",
      "109. What is linear regression? How linear regression is performed using least square method? Find the regression line for the data points (x, y) tabulated below: (10)",
      "110. Also, discuss the terms 'mean squared error' and 'mean absolute errors'.",
      "111. What is Iterative Deepening Depth First Search (IDDFS)? How is it different from Depth First Search? Give time and space complexities of IDDFS. Also give advantages and disadvantages of IDDFS. (10)",
      "112. Discuss support vector regression. Draw suitable diagram in support of your discussion. Also give two applications of support vector regression. (10)",
      "113. Compare model-free reinforcement learning with mode-based reinforcement learning. Also, discuss the sub-classes of model-free reinforcement learning. (6)",
      "114. Explain reinforcement learning with the help of a block diagram. Explain the role of each component of block diagram. (6)",
      "115. Write and explain Bayes' theorem. Also, write and explain Naive Bayes' algorithm with suitable example. (7)",
      "116. Support Vector Machines",
      "117. Support Vector Regression",
      "118. Polynomial Regression",
      "119. Compare classification and regression techniques of supervised learning. Explain the various metrics used for evaluating the classification model. (7)",
      "120. Write ID3-algorithm for creating decision tree for any training dataset. (10)",
      "121. Explain Dempster Shafer theory with a suitable example. (10)",
      "122. Consider the two-dimensional patterns (2, 1), (3, 5), (4, 3), (5, 6), (6, 7), (8, 8), (9, 10) and (7, 8). Using PCA algorithm, calculate the principal component. (10)",
      "123. Commutative",
      "124. Associative",
      "125. Distributive",
      "126. De-Morgan's laws"
    ],
    "QUESTION 5 (20 Marks - Short Notes)": [
      "127. Draw a semantic network for the following English statement: \"Mohan greets Nita and Nita's mother greets Mohan.\" (10)",
      "128. Suppose a six-faced die is thrown twice. Describe each of the following events: (10) - (i) The maximum score is 6 - (ii) The total score is 9 - (iii) Each throw results in an even score larger than 2",
      "129. Consider the following missionaries and cannibal problem: Three missionaries and three cannibals are side of a river, along with a boat that can hold one or two people. Find a way to get everyone to the other side, without ever leaving a group of missionaries out-numbered by cannibals. (10) - (i) Formulate and solve the above problem - (ii) Draw the state-space search graph for solving this problem",
      "130. What are the various factors used to be taken into consideration while developing a state space representation? (10)"
    ]
  },
  "MCS-226: Data Science and Big Data": {
    "QUESTION 1 (COMPULSORY - Total 40 Marks)": [
      "1. Define Data Science. Give advantages of Data Science in an organization. (5)",
      "2. Explain data science with the help of its applications. Also, discuss how structured data is different from semi-structured data. (6)",
      "3. What are the common misconceptions of data science? Explain the different stages of data science life cycle with the help of a diagram. (8)",
      "4. Explain the following types of data: (6)",
      "5. Semi-structured data",
      "6. Unstructured data",
      "7. Qualitative data",
      "8. Quantitative data",
      "9. What are the different types of data in Data Science? Briefly explain each type. (5)",
      "10. Explain the following types of data, used in data science. Give suitable example for each: (10)",
      "11. Structured data",
      "12. Semi-structured data",
      "13. Unstructured data",
      "14. Data streams",
      "15. Explain the following types of data analysis: (8)",
      "16. Descriptive Analysis",
      "17. Exploratory Analysis",
      "18. Inferential Analysis",
      "19. Predictive Analysis",
      "20. Explain Bayes' Theorem with suitable equation and example. (5)",
      "21. What is meant by 'Conditional Probability'? Explain with the help of a diagram. Also, explain the Bayes theorem. (6)",
      "22. What is Bayes theorem? Explain Bayes theorem with the help of an example. (6)",
      "23. What is conditional probability? Write the equation for conditional probability and describe its components with a suitable example. (5)",
      "24. Explain conditional probability with equation and suitable example. (5)",
      "25. What is meant by \"Probability distribution of continuous random variable\"? Explain with the help of a diagram. Also explain the normal distribution. (6)",
      "26. What is the concept of random variable? Explain the characteristics of binomial and normal distribution. (6)",
      "27. What is Binomial Distribution? Write the formula for binomial probability distribution and use it to produce the probability distribution for the case of three tosses of the coin. (5)",
      "28. How does sampling differ from population? Also, discuss the relation of the terms 'statistic' and 'parameter', with sampling and population, respectively. (5)",
      "29. What is a Histogram? How does Histogram differ from Bargraph? Briefly discuss the utility of Histogram in Data Science. (5)",
      "30. What is a BoxPlot? What are whiskers in any BoxPlot? Briefly discuss the utility of BoxPlots in Data Science. (5)",
      "31. What do you mean by Box Plot? Explain clearly how the Box plot differs from Scatter plot. What is the utility of Box Plot in Data Science? Explain in detail. (10)",
      "32. What is a Heat Map? Give uses and best practices for Heat Maps. (5)",
      "33. What is a scatter plot? Give uses and best practices for scatter plot. (5)",
      "34. What is the use of scatter plot? How can you draw a scatter plot using R-programming language? (4)",
      "35. What is the use of pair plot? Explain how do you read a pair plot. (4)",
      "36. What is Hadoop MapReduce? Give its advantages. Also, discuss how <key-value> pair mechanism facilitates MapReduce programming. (5)",
      "37. What is MapReduce? Explain the Map function and Reduce function in the Map-Reduce architecture with a suitable block diagram. (5)",
      "38. Explain the following operations of map-reduce with suitable example and supporting block diagram: (10)",
      "39. Splitting",
      "40. Mapping",
      "41. Shuffling",
      "42. Reducing",
      "43. Explain shuffling and sorting using the example of word count. (6)",
      "44. Explain the steps of map-reduce paradigm using the example of word counting. (6)",
      "45. Explain word count problem with suitable example. Give pseudo-code for word count problem in MapReduce. (5)",
      "46. What are the characteristics of Hadoop Distributed File System (HDFS)? Why is it used for Big data processing? (6)",
      "47. What is HDFS? Write steps to load data into HDFS format. (5)",
      "48. Explain the term 'Distributed File System' in the context of big data. Also explain the different features of distributed file system. (6)",
      "49. In context of Data Science, what is Apache SPARK? How does Apache SPARK differ from Hadoop? (5)",
      "50. What is Apache Spark? What are the features of Apache Spark that differ from Hadoop? (5)",
      "51. What is Apache Spark? Give main features of Apache Spark framework. (5)",
      "52. What do you mean by 'Big Data Analysis'? Explain big data processing using spark ecosystem. (6)",
      "53. Briefly discuss the purpose of the following components of Apache Spark: (10)",
      "54. Spark core",
      "55. Spark SQL",
      "56. Spark Streaming",
      "57. MLib",
      "58. Graph X",
      "59. What are Data Streams? How do Data Streams differ from Databases? Why mining of data streams is considered as a challenging process in Data Science? (5)",
      "60. Explain Data Streams. Justify the statement, \"Data Stream is a challenging task in Data Science\". (5)",
      "61. Explain the characteristics of data streams. (4)",
      "62. Differentiate between Data Stream Management System (DSMS) and Data Base Management System (DBMS). (5)",
      "63. Differentiate between database management system and data stream management system with the help of a diagram. Also, discuss the issues and challenges of data stream. (5)",
      "64. Compare Ad-hoc Queries and Standing Queries of data streams. Give example for each. (5)",
      "65. Explain any one mechanism of filtering of data streams. (4)",
      "66. What do you mean by data stream processing? Which model of data stream processing is useful in finding stock market trends? Justify your answer. (8)",
      "67. What is NoSQL? Explain the features of NoSQL databases. (6)",
      "68. What are NoSQL databases? Why are they used? (4)",
      "69. Explain NoSQL. What are the differences between RDBMS and NoSQL. (5)",
      "70. What is Graph based NoSQL? Explain when do we need graph database with the help of an example. (6)",
      "71. What is key-value pair based NoSQL? List the benefits of key-value pair based NoSQL. Explain when to use key-value NoSQL database with the help of an example. (6)",
      "72. Explain PageRank algorithm, with suitable example. (5)",
      "73. What is meant by Link Analysis? Explain the rank computation using MapReduce. (6)",
      "74. Explain the term 'Link Analysis'. Briefly discuss the purpose of link analysis in data science. How link analysis can be used for World Wide Web (WWW)? (5)",
      "75. What is meant by Page Rank? Explain the use of page rank in search engines with the help of an example. (5)",
      "76. How can link analysis be used to compute PageRank? (4)",
      "77. What are Dataframes in 'R' programming? Give characteristics of Dataframes. (5)",
      "78. Briefly describe the following data structures of 'R' programming with the help of an example for each: (5)",
      "79. Vector",
      "80. List",
      "81. Explain the following, with the help of an example, in the context of R programming: (6)",
      "82. Dataframe",
      "83. List",
      "84. Vector",
      "85. Explain the following, with the help of an example, in the context of R-programming: (8)",
      "86. Strings",
      "87. Matrices",
      "88. Bar charts",
      "89. Scatter plots",
      "90. What are the factors in R programming? Give characteristics of factors. (5)",
      "91. What is JSON File in R? How to convert JSON into a data frame? (5)",
      "92. Explain different types of data structures in R-language. Which function of R-programming can be used to implement linear regression? Explain linear regression using R-language. (6)",
      "93. Define the term similarity. Explain the similarity of documents with the help of an example. (6)",
      "94. What is a Euclidean distance measure? How does it differ from cosine distance? (5)",
      "95. What is the purpose of a distance measure? Differentiate between cosine distance and edit distance with the help of an example. (6)",
      "96. Discuss why data preprocessing is important in data science and big data applications with the help of suitable diagram. Also discuss different phases of data preprocessing. (6)",
      "97. What is logistic regression? Which function of R programming can be used to implement logistic regression? (4)",
      "98. Explain the use of Bloom filtering with the help of an example. (5)",
      "99. What is Web Analytics? Explain the issues in online advertising. (5)",
      "100. Write the syntax to create the following plots in 'R': (5)",
      "101. Bar charts",
      "102. Box plots",
      "103. Histogram",
      "104. Line graphs",
      "105. Scatter plots",
      "106. Explain the following types of graphs used (using syntax) for visualization in R-programming language: (6)",
      "107. Bar-charts",
      "108. Box-plots",
      "109. Line-graphs",
      "110. List the key characteristics of various types of plots for data visualization. Also, define the different methods for collecting, analysing and interpreting the numerical information. (6)",
      "111. What is a box plot? List the commands of R programming that can be used to create a box plot. (5)",
      "112. Write an R program to create two 3×3 matrices and multiply them. How is this program different from a similar C program? (5)",
      "113. Write a code in R programming to perform concatenation of the following three strings: \"Helo\", \",\" \"Learning is Fun\" (5)",
      "114. Explain and write the steps of how R-programming can be used for the following: (5×4=20)",
      "115. Logistic Regression",
      "116. K-mean Clustering",
      "117. Random Forest",
      "118. Association Rules",
      "119. Time Series Analysis",
      "120. Differentiate between Linear Regression and Multiple Regression, with suitable example for each. (5)",
      "121. What is multiple regression? Write steps about how R programming can be used to create multiple regression model. (5)",
      "122. What is Logistic Regression? Give its utility. Also, write and discuss the function of 'R' used to construct the model for logistic regression. (5)",
      "123. What is Logistic Regression? Write steps about how R-programming can be used to create logistic regression model. (6)",
      "124. What are Decision Trees? What are categorical variables and continuous variables? How do these two variables relate to decision trees? Explain the role of entropy and information gain in decision trees. (10)",
      "125. What is a decision tree? Write steps on how R programming can be used for making decision tree. (5)",
      "126. What is a Random Forest? How does it differ from Decision tree? Explain the role of partitioning, pruning and tree selection process in the working of decision tree. (10)",
      "127. Explain, where do we use random forests algorithm. Write the pseudo-code for random forests algorithm. Also, write steps on how R-programming can be used making a decision tree. (8)",
      "128. Compare qualitative data with quantitative data. What do you understand by the term \"Measurement scale of data\"? Give characteristics of measurement scales of data. List various measurement scales with suitable example for each. (10)",
      "129. What is a Random Variable? Differentiate between Discrete Random Variable and Continuous Random Variable. (5)",
      "130. Explain the characteristics of measurement scales of data. Use these characteristics to define various measurement scales of data. (6)",
      "131. Explain the steps of significance testing, with the help of an example. (8)",
      "132. Explain the following terms with the help of an example: (6)",
      "133. Data pre-processing",
      "134. Data curation",
      "135. Data cleaning",
      "136. What is Data Cleaning? List and briefly discuss the best practices used for data cleaning and data preparation. (5)",
      "137. What is data cleaning? What are the methods of data cleaning? (5)",
      "138. What are the two measures to define the central tendencies of quantitative data? Explain with the help of an example. Also, discuss different measures to define the spread or variability of observed quantitative data with the help of examples. (8)",
      "139. Explain the following terms with the help of an example: (8)",
      "140. Sampling",
      "141. Dredging",
      "142. Simpson's paradox",
      "143. Histograms",
      "144. Explain the term Data lake. Briefly discuss the key capabilities of data lake. (5)",
      "145. Compare Land Mark Model and Sliding Windows Model for data stream processing. (5)",
      "146. Explain the characteristics of Big data. How does Big data differ from relational data? (6)",
      "147. Explain four V's in the context of big data with the help of an example. (8)",
      "148. What is Big Data? What are the characteristics of Big Data? (5)",
      "149. Differentiate between Big Data and Data Warehouse, with suitable explanation for each. (5)",
      "150. Apache Spark",
      "151. Hive",
      "152. Column-based databases",
      "153. Graph-based databases",
      "154. Explain, how Master/Slave process works in HDFS architecture. Also, differentiate between Apache Hadoop-1 and Hadoop-2 using suitable diagram. (8)",
      "155. Explain the concept of Recommendation System. (6)",
      "156. Explain how the similarity between two documents can be found. (6)",
      "157. What do you understand by the term 'Finding Similar Documents'? What are the various concepts of document similarity analysis? Compare Minhashing and locality sensitive hashing for document similarity with suitable illustrations. (10)",
      "158. What is a recommander system? Discuss the process of content-based recommendations using suitable diagram. (6)",
      "159. Explain how the social networks can be represented using a graph. (4)",
      "160. What do you understand by HIVE? Explain the components of HIVE architecture with diagram. (5)",
      "161. What is Link Spamming? Illustrate link spam with a suitable example. What are the possible solutions to combat link spamming? (10)",
      "162. Explain the spider trap and dead-end problem in PageRank. Discuss the solutions for the spider trap and dead-end problem. (6)"
    ],
    "QUESTION 5 (SHORT NOTES - 4×5 or 5×4 = 20 Marks)": [
      "163. Write short notes on the following (any four/five):"
    ]
  },
  "MEC-109: Research Methods in Economics": {
    "SECTION A (20 Marks Questions - Answer any 2 in 700 words each)": [
      "1. Discuss the various steps involved in research process with illustrations.",
      "2. What is the role of philosophical perspectives in guiding research methodology of a study? Discuss in detail with a suitable example.",
      "3. What are the aims and methods of science? Explain the differences between inductive model and hypothetico-deductive model as knowledge-seeking activity.",
      "4. Distinguish between Research Methods and Research Methodology. Discuss the methodologies used in Interpretive Research.",
      "5. State the difference between Research Methods and Research Methodology. Explain the various steps involved in formulation of a research proposal.",
      "6. What are the criticisms of Hypothetico-Deductive model to the structure of a theory? Discuss.",
      "7. Is there a logical asymmetry between Verification and Falsification approach? Discuss your arguments in the light of Popper's approach.",
      "8. Give a comparative overview of the verification and falsification. Comment on Popperian view of Verisimilitude.",
      "9. Explain research design for a mixed-method research with an example.",
      "10. What is mixed method research? Explain and illustrate the rationale for the use of mixed methods.",
      "11. What do you mean by the term Hypothesis? What are its sources? Which steps are involved in testing a hypothesis?",
      "12. Distinguish between the Quantitative and Qualitative Data. Discuss the various scales to measure the data.",
      "13. State the various methods used in collection of data in social sciences. Explain the operational procedure for selection of sample by Simple Random Sampling With Replacement (SRSWR). How will you evaluate the precision of estimates from SRSWR samples?",
      "14. Using suitable examples, explain the following data collection methods:",
      "15. Stratified random sampling",
      "16. Purposive sampling",
      "17. In order to find out the incidence of poverty among households in a village, explain how the multistage sampling can be applied. Compare the operational procedure of drawing a stratified sample with multi-stage sample.",
      "18. Distinguish between a non-participant and quasi-participant observation methods. How relevant are the ethical considerations in this context?",
      "19. What is Action Research? You are asked to undertake Action Research for reducing malnourishment among adolescent students of a school in a rural area of Gujarat. What steps will you take for data collection, analysis and developing actions?",
      "20. Discuss the various steps involved in construction of composite indices. How will you handle the problem of missing data and outliers in construction of composite indices?",
      "21. What is Composite Index? Explain the steps involved in construction of a composite index.",
      "22. What is a composite index? What is the advantage of using Principal Component Analysis (PCA) method in constructing a composite index?",
      "23. Discuss the concept and types of content analysis. Identify the areas of social sciences where content analysis can be used.",
      "24. Give an overview of structural equation modeling. When is this approach adopted?",
      "25. How is canonical Correlation Analysis a generalization of Multiple Regression Analysis? Explain.",
      "26. Describe the major trade and finance related data available in RBI Handbook of Statistics on the Indian Economy.",
      "27. Discuss the sources of financial data available for money and capital market. How does this data help the researchers in identifying research issues and an analysis?",
      "28. Explain the National Family Health Survey (NFHS) as a database for public health. Discuss how this database is useful for researchers.",
      "29. Which research strategies are suitable for qualitative research? Discuss the methodology of critical theory paradigm.",
      "30. Distinguish between Hierarchical and Non-hierarchical methods of clustering. Explain the criteria for choosing them for a specific research problem."
    ],
    "SECTION B (12 Marks Questions - Answer any 5 in 400 words each)": [
      "31. What is hypothesis? Is it necessary to formulate hypothesis in all types of research? Give reasons.",
      "32. Discuss the important features of interpretative paradigm.",
      "33. What is the difference between research design and research methods? Briefly explain the methods of univariate data analysis.",
      "34. What are the characteristics of Action Research? Explain its utility for policy making.",
      "35. How do characteristics of Action Research make it a powerful tool for change at local level for the disadvantaged groups?",
      "36. Using a suitable example, discuss the advantages and disadvantages of Action Research.",
      "37. What is the distinction between explanatory research and descriptive research? State the various steps involved in carrying out descriptive research in social sciences.",
      "38. Which method is practically more reliable among participant and non-participant observations? Give reasons in support of your answer.",
      "39. What are the important points to be kept in mind while developing categories in content analysis?",
      "40. Identify the steps for analyzing qualitative data. How do you analyze findings from Grounded Theory?",
      "41. What is the technique of Focus Group Discuss (FGD)? How useful is it to evaluate the implementation of MGNREGA in a village?",
      "42. State the data sources of National Income and its related aggregates.",
      "43. Identify the major sources of data on industries. How is this data useful for researchers?",
      "44. How can you evaluate industrial performance using data from Annual Survey of Industry (ASI) and Index of Industrial Production?",
      "45. What information is required to examine the impact of air pollution on health of citizens of a metropolitan city?",
      "46. Explain two-step cluster analysis as a non-hierarchical approach.",
      "47. Which quantitative methods can be used for reduction of dimensionality? Briefly discuss any two.",
      "48. Explain the Hirschman-Herfindahl Index as a positive measure of inequality.",
      "49. Discuss how Sen's inequality index is a generalization of Atkinson's index.",
      "50. Explain the merit of Sen's Index as a measure of poverty and inequality.",
      "51. Explain Lorentz curve as a tool for measuring inequality in the cases of the following:",
      "52. Perfect equality",
      "53. Perfect inequality",
      "54. Relative inequality",
      "55. Differentiate between comparative and non-comparative scaling techniques with illustrations.",
      "56. Evaluate Nominal, Ordinal, Ratio and Interval scale variables on a set of common parameters and discuss which measure of central tendency is applicable to their analysis.",
      "57. Discuss how the coefficient of determination and analysis of variance enhance research insights in a multi-variate regression model.",
      "58. Explain the significance of normal distribution assumption in regression analysis.",
      "59. State the assumptions of classical linear regression model. What are the implications of the presence of autocorrelation? How will you detect it?",
      "60. In the context of regression model, discuss the usefulness of Analysis of Variance (ANOVA).",
      "61. Explain and illustrate the applicability of reciprocal form of regression model in economics.",
      "62. Distinguish between a Semi-log model and Log-linear model of regression. Discuss their applications in research.",
      "63. How useful is the value of adjusted R-square (R²) in evaluating a statistical fit? Illustrate.",
      "64. What is multicollinearity? How do you detect it? What are its implications?",
      "65. How is a representative sample drawn from a population using stratified random sampling?",
      "66. What is snowball sampling? Illustrate its appropriate application.",
      "67. Why is quasi-participant method a preferred approach for data collection than observation?",
      "68. What is Correspondence Analysis? How useful is this technique to analyse the grouped and ungrouped data?",
      "69. What is Correspondence Analysis (CA)? Discuss the features and applications of CA in social science research.",
      "70. Discuss how correspondence analysis is useful for analysing associations? Does it apply for categorical variables?",
      "71. What is canonical correlation? In which type of enquiry it is most appropriate to apply?",
      "72. Discuss how canonical correlation analysis helps to analyze interdisciplinary constructs using a simple example.",
      "73. Outline the steps for constructing a composite index using Range Equalisation method.",
      "74. What is Composite Index? How should one deal with missing values while generating a Composite Index?",
      "75. Discuss the criteria for evaluating measurements in research.",
      "76. What is the difference between realism and instrumentalism? Critically evaluate Milton Friedman's approach of Instrumentalism.",
      "77. Distinguish Between (Select any 3)",
      "78. Quantitative and Qualitative variables",
      "79. Popper's and Kuhn's perspective on essence of science",
      "80. Time series data and Cross-sectional data",
      "81. Autocorrelation and Heteroscedasticity",
      "82. Advanced estimates and Revised estimates of GDP",
      "83. Descriptive and Explanatory Research",
      "84. Census and Sample",
      "85. Semi-log and Reciprocal models",
      "86. Narratives and Oral History",
      "87. Retroduction and Abduction",
      "88. Life history and narratives",
      "89. Sampling and non-sampling errors",
      "90. Instrumentalism vs. Realism",
      "91. Positive and normative measures of inequality",
      "92. Research design and research methods",
      "93. Time-series and Pooled data",
      "94. Action and Exploratory research",
      "95. Induction and Deduction approach of enquiry",
      "96. Nominal and Ordinal scaling techniques",
      "97. Ontology and Epistemology",
      "98. Oral Histories and Life History",
      "99. Participant and Non-participant observation",
      "100. Pooled data and Panel data",
      "101. Questionnaire and Schedule",
      "102. Population census and Economic census",
      "103. Primary and Secondary data",
      "104. Population Census and Economic Census",
      "105. Research Techniques and Research Tools",
      "106. Measured variable and Latent variable",
      "107. Inclusion and Exclusion of variables and their linkage with Adjusted-R²",
      "108. Ontology and Epistemology",
      "109. Research Methodology and Research Methods",
      "110. Nominal and Ordinal Scale of Measurement",
      "111. Sampling and Non-sampling Errors",
      "112. Induction and Deduction"
    ]
  }
}
